In [1]:
#Importando a biblioteca Pandas
import pandas as pd

In [2]:
#Carregando o arquivo(planilha):
try:
    df = pd.read_csv('credit_scoring_eng.csv')
except: 
    df= pd.read_csv('/datasets/credit_scoring_eng.csv')

In [3]:
#Explorando o arquivo:
df.info()
df.head(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,-2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,-152.779569,50,SECONDARY EDUCATION,1,married,0,M,employee,0,21731.829,education
8,2,-6929.865299,35,BACHELOR'S DEGREE,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,-2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family

In [4]:
#Inspecionando colunas, começando pela coluna 'children':
df['children'].value_counts()
#Ninguém pode ter -1 filhos, vou substituir este valor por 0, pois não sabemos ao certo a quantidade correta de filhos.

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

In [5]:
#Substituindo valores -1 por 0 na coluna 'children'
df[df['children'] == -1] = 0

In [6]:
#Vou substituir o número 'children' 20 também, pois é anômalo. Vou substituir pela mediana de 'children'.
df_children_median = df['children'].median()

In [7]:
#Substituindo os valores 20 pela mediana na coluna 'children':
df[df['children']==20] = df_children_median

In [8]:
#Verificando coluna 'children' novamente, está corrigido.
df['children'].value_counts()

0    14272
1     4818
2     2055
3      330
4       41
5        9
Name: children, dtype: int64

In [9]:
#Inspecionando coluna 'days_employed':
df['days_employed'].value_counts()
#Existem valores negativos. Vou transformá-los em positivo, pois a pessoa que os inseriu pode ter inserido incorretamente.

 0.000000         123
-8437.673028        1
-1122.320892        1
 356425.151366      1
-3112.788664        1
                 ...
 353207.809226      1
-1083.159959        1
 390769.069031      1
 341277.435955      1
-1984.507589        1
Name: days_employed, Length: 19241, dtype: int64

In [10]:
#Criando função para transformar números negativos em positivos:
def numero_positivo(valor):
    if valor <0:
        valor = valor * -1
    return valor
#Utilizando função para transformar números negativos em positivos:
df['days_employed'] = df['days_employed'].apply(numero_positivo)

In [11]:
#Verificando números da coluna 'days_employed'.
df['days_employed'].value_counts()

0.000000         123
8437.673028        1
1122.320892        1
356425.151366      1
3112.788664        1
                ...
353207.809226      1
1083.159959        1
390769.069031      1
341277.435955      1
1984.507589        1
Name: days_employed, Length: 19241, dtype: int64

In [12]:
#Inspecionando coluna 'dob_years':
df['dob_years'].value_counts().sort_index(ascending=True)
#Ninguém que tem empréstimo no banco é menor do que 18 anos supostamente, e zero anos seria um bebê. Dado provavelmente incorreto.
#Vou substituir pela média de idade.

0     223
19     14
20     51
21    110
22    183
23    252
24    263
25    356
26    406
27    490
28    501
29    543
30    536
31    556
32    506
33    577
34    597
35    614
36    553
37    531
38    595
39    572
40    603
41    603
42    592
43    510
44    543
45    494
46    469
47    480
48    536
49    505
50    509
51    446
52    483
53    457
54    476
55    441
56    482
57    457
58    461
59    441
60    376
61    353
62    351
63    268
64    263
65    194
66    183
67    167
68     99
69     83
70     65
71     58
72     33
73      8
74      6
75      1
Name: dob_years, dtype: int64

In [13]:
#Descobrindo a média de idade:
dob_years_mean = df['dob_years'].mean()

In [14]:
#Transformando valores iguais a zero em valores da média da coluna 'dob_years':
df[df['dob_years'] == 0] = dob_years_mean

In [15]:
#Verificando se foi corrigido:
df['dob_years'].value_counts()
#Números ficaram em 'float', como se tivessem vírgula, vou alterar depois.

35.000000    614
40.000000    603
41.000000    603
34.000000    597
38.000000    595
42.000000    592
33.000000    577
39.000000    572
31.000000    556
36.000000    553
44.000000    543
29.000000    543
30.000000    536
48.000000    536
37.000000    531
43.000000    510
50.000000    509
32.000000    506
49.000000    505
28.000000    501
45.000000    494
27.000000    490
52.000000    483
56.000000    482
47.000000    480
54.000000    476
46.000000    469
58.000000    461
57.000000    457
53.000000    457
51.000000    446
59.000000    441
55.000000    441
26.000000    406
60.000000    376
25.000000    356
61.000000    353
62.000000    351
63.000000    268
64.000000    263
24.000000    263
23.000000    252
43.052776    223
65.000000    194
22.000000    183
66.000000    183
67.000000    167
21.000000    110
68.000000     99
69.000000     83
70.000000     65
71.000000     58
20.000000     51
72.000000     33
19.000000     14
73.000000      8
74.000000      6
75.000000      1
Name: dob_years, dtype: int64

In [16]:
#Verificando coluna 'education':
df['education'].value_counts()
#Coluna 'education' tem valores em letra minúscula e letra maiúscula, além de ter um número que não corresponde a nada.

secondary education    13609
bachelor's degree       4666
SECONDARY EDUCATION      764
Secondary Education      700
some college             663
BACHELOR'S DEGREE        270
Bachelor's Degree        266
primary education        250
43.052775842044134       223
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
Graduate Degree            1
GRADUATE DEGREE            1
Name: education, dtype: int64

In [17]:
#Olhando mais de perto estas linhas
df[df['education'] == 43.052775842044134]
#Podemos excluir estas linhas

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
99,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
149,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
270,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
291,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
578,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
...,...,...,...,...,...,...,...,...,...,...,...,...
21313,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
21325,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
21390,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
21404,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776
21491,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776,43.052776

In [18]:
#Excluindo do dataframe linhas da coluna 'education' com número 43.2004181184669.
df = df[df['education'] != 43.052775842044134]

In [19]:
#Verificando se linhas foram excluídas
df[df['education'] ==43.052775842044134]

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose]
Index: []

In [20]:
#Transformando todos valores da coluna 'education' em valores minúsculos
df['education'] = df['education'].str.lower()

In [21]:
#Verificando valores da coluna 'education'
df['education'].value_counts()

secondary education    15073
bachelor's degree       5202
some college             739
primary education        282
graduate degree            6
Name: education, dtype: int64

In [22]:
#Calculando valores duplicados
df.duplicated().sum()

71

Possíveis motivos dos valores duplicados:
1) O cliente pediu mais de um empréstimo
2) Perfis de clientes diferentes com os mesmos dados para todas colunas
3) Dados com letras minúsculas e maiúsculas

Não temos um ID de cliente que identifique exclusivamente os clientes. É possível que duas pessoas tenham os mesmos valores exatos para as demais colunas.
Por essa razão, não vou excluir duplicatas

Possíveis motivos dos valores ausentes:
1) A pessoa está atualmente desempregada
2) A pessoa mudou de emprego e o sistema do banco não está atualizado
3) Erro de quem inseriu as informações no banco de dados

In [23]:
#Calculando valores ausentes
#Percebe-se valores ausentes nas duas colunas 'days_employed' e 'total_income'
df.isna().sum()

children               0
days_employed       2152
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2152
purpose                0
dtype: int64

In [24]:
#Verificando se as duas colunas estão relacionadas, de acordo com os valores ausentes.
filtered_df_days_employed = df[df['days_employed'].isna()]
filtered_df_total_income = df[df['total_income'].isna()]
filtered_df_days_employed_list = filtered_df_days_employed.index.to_list()
filtered_df_total_income_list = filtered_df_total_income.index.to_list()
#Verificando se são iguais
filtered_df_total_income_list == filtered_df_days_employed_list
#São iguais

True

In [25]:
#Como são valores quantitativos, vou utilizar a média e a mediana para preencher os valores ausentes
#Vou utilizar a mediana para preencher os valores ausentes da coluna 'days_employed', pois são valores atípicos
df_days_employed_median = df['days_employed'].median()
df['days_employed'] = df['days_employed'].fillna(value = df_days_employed_median)

In [26]:
#Vou utilizar a média para preencher os valores em total_income, pois não são valores atípicos
df_total_income_mean = df['total_income'].mean()
df['total_income'] = df['total_income'].fillna(value = df_total_income_mean)

In [27]:
#Verificando se valores ausentes foram preenchidos
df.isna().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64

In [28]:
#Exibindo informações da tabela novamente
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21302 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21302 non-null  float64
 1   days_employed     21302 non-null  float64
 2   dob_years         21302 non-null  float64
 3   education         21302 non-null  object
 4   education_id      21302 non-null  float64
 5   family_status     21302 non-null  object
 6   family_status_id  21302 non-null  float64
 7   gender            21302 non-null  object
 8   income_type       21302 non-null  object
 9   debt              21302 non-null  float64
 10  total_income      21302 non-null  float64
 11  purpose           21302 non-null  object
dtypes: float64(7), object(5)
memory usage: 2.1+ MB

In [29]:
#Transformando valores 'float' em 'int':
df['days_employed'] = df['days_employed'].astype('int64')
df['dob_years'] = df['dob_years'].astype('int64')
df['education_id'] = df['education_id'].astype('int64')
df['family_status_id'] = df['family_status_id'].astype('int64')
df['debt'] = df['debt'].astype('int64')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21302 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21302 non-null  float64
 1   days_employed     21302 non-null  int64
 2   dob_years         21302 non-null  int64
 3   education         21302 non-null  object
 4   education_id      21302 non-null  int64
 5   family_status     21302 non-null  object
 6   family_status_id  21302 non-null  int64
 7   gender            21302 non-null  object
 8   income_type       21302 non-null  object
 9   debt              21302 non-null  int64
 10  total_income      21302 non-null  float64
 11  purpose           21302 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.1+ MB

In [31]:
#Criando função para categorizar valores de acordo com o status familiar e a quantidade de filhos:
def family_category(row):
    if row['children'] == 0 and row['family_status'] in ['married','civil partnership']:
        return 'Com união, sem filhos'
    if row['children'] == 0 and row['family_status'] in ['unmarried','divorced','widow / widower']:
        return 'Sem união, sem filhos'
    if row['children'] == 1 and row['family_status']in ['married','civil partnership']:
        return 'Com união, com 1 filho'
    if row['children'] == 1 and row['family_status'] in ['unmarried','divorced','widow / widower']:
        return 'Sem união, com 1 filho'
    if row['children'] in [2,3,4,5] and row['family_status'] in ['married','civil partnership']:
        return 'Com união, com 2-5 filhos'
    if row['children'] in [2,3,4,5] and row['family_status'] in ['unmarried','divorced','widow / widower']:
        return 'Sem união, com 2-5 filhos'
#Aplicando função e criando nova coluna 'credit_potential':
df['family_category'] = df.apply(family_category, axis = 1)

In [32]:
#Utilizando groupby para analisar a média da coluna 'debt':
df.groupby('family_category')['debt'].mean().sort_values(ascending = True)

family_category
Com união, sem filhos        0.072590
Sem união, sem filhos        0.081870
Com união, com 1 filho       0.091253
Com união, com 2-5 filhos    0.091524
Sem união, com 1 filho       0.094611
Sem união, com 2-5 filhos    0.108911
Name: debt, dtype: float64

Existe alguma relação entre ter filhos e pagar um empréstimo em dia? Parece que quanto menos filhos, menor a chance de inadimplência.
Existe alguma relação entre o estado civil e o pagamento de um empréstimo no prazo estipulado? Parece que quando a pessoa é sepadarada, maior a chance de inadimplência.

In [33]:
#Criando função para categorizar clientes em níveis de potencial de crédito
def credit_potential(row):
    if row['family_category'] == 'Com união, sem filhos':
        return 'Alto'
    if row['family_category'] == 'Sem união, sem filhos':
        return 'Alto'
    if row ['family_category'] == 'Com união, com 1 filho':
        return 'Médio'
    if row['family_category'] == 'Com união, com 2-5 filhos':
        return 'Médio'
    if row['family_category'] =='Sem união, com 1 filho':
        return 'Baixo'
    if row['family_category'] == 'Sem união, com 2-5 filhos':
        return 'Baixo'
df['credit_potential'] = df.apply(credit_potential, axis = 1)

In [35]:
#Utilizando o groupby para ajudar a analisar
df.groupby('family_category')['debt','total_income'].mean().sort_values(by='total_income',ascending=True)

C:\Users\Graciette\AppData\Local\Temp\ipykernel_992\2805012653.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby('family_category')['debt','total_income'].mean().sort_values(by='total_income',ascending=True)

                               debt  total_income
family_category
Sem união, sem filhos      0.081870  26178.413278
Sem união, com 2-5 filhos  0.108911  26251.229591
Com união, sem filhos      0.072590  26577.248258
Sem união, com 1 filho     0.094611  27046.945276
Com união, com 1 filho     0.091253  27408.568327
Com união, com 2-5 filhos  0.091524  27769.279754

Existe uma relação entre o nível de renda e o pagamento de um empréstimo no prazo? Parece que quanto mais 'income', maior a inadimplência, mas não é uma relação direta.

In [36]:
#Utilizando o groupby para ajudar a analisar
df.groupby('purpose')['debt'].mean().sort_values(ascending=True)

purpose
purchase of my own house                    0.055016
housing renovation                          0.057661
property                                    0.065287
construction of own property                0.065495
buy residential real estate                 0.068333
buy real estate                             0.069805
buy commercial real estate                  0.069909
purchase of the house for my family         0.070423
housing                                     0.072327
education                                   0.072893
housing transactions                        0.073209
purchase of the house                       0.074016
buying a second-hand car                    0.074153
to have a wedding                           0.074607
building a real estate                      0.077544
having a wedding                            0.079427
wedding ceremony                            0.079646
transactions with my real estate            0.079872
buying property for renting out             0.080123
transactions with commercial real estate    0.080745
getting an education                        0.081818
real estate transactions                    0.082090
supplementary education                     0.083516
car                                         0.084016
building a property                         0.087097
going to university                         0.087221
university education                        0.090090
car purchase                                0.091703
buying my own car                           0.091816
to buy a car                                0.092275
cars                                        0.092827
to become educated                          0.094891
to own a car                                0.095339
profile education                           0.102088
second-hand car purchase                    0.105809
getting higher education                    0.108747
purchase of a car                           0.110132
to get a supplementary education            0.115124
Name: debt, dtype: float64

Como as diferentes finalidades do empréstimo afetam o pagamento pontual do empréstimo? A maior parte dos empréstimos é utilizado para compra de um carro e investimento em educação.

Conclusão geral: Quando a pessoa é separada e tem mais filhos, maior a chance de inadimplência. A renda não tem tanto impacto na inadimplência. Mas sim a quantidade de filhos e o estado civil.